Tekla.Structures.Model.BaseRebarModifier
Represents a modifier that can modify the characteristics of Tekla.Structures.Model.RebarSet reinforcing bars that pass through it.

Tekla.Structures.Model.BaseRebarModifier.#ctor
Initializes a new instance of the Tekla.Structures.Model.BaseRebarModifier class.

Tekla.Structures.Model.BaseRebarModifier.Father
Gets or sets the Tekla.Structures.Model.RebarSet to which the modifier belongs.
Only reinforcing bars generated by this Tekla.Structures.Model.RebarSet can be modified by this rebar modifier.

Tekla.Structures.Model.BaseRebarModifier.Curve
Gets or sets the geometric Tekla.Structures.Model.Contour of the rebar modifier.

Tekla.Structures.Model.BaseRebarModifier.BarsAffected
Gets or sets the reinforcing bars affected.

Tekla.Structures.Model.BaseRebarModifier.FirstAffectedBar
Gets or sets the first affected bar.
If set to zero, the first affected bar will be chosen automatically.

Tekla.Structures.Model.BaseRebarModifier.FollowEdges
Gets or sets a flag that indicates whether the modifier should attempt to follow
the leg face edges located between its end points.

Tekla.Structures.Model.BaseRebarModifier.OrderNumber
Gets or sets the order number of the rebar modifier that determines the order that rebar modifiers are applied to the Tekla.Structures.Model.RebarSet.
(Made private because the functionality exists internally but is not currently to be exposed publicly).

Tekla.Structures.Model.BaseRebarModifier.Insert
Inserts the rebar modifier into the model database.
Returns: True if successful, otherwise false.

Tekla.Structures.Model.BaseRebarModifier.Modify
Modifies the existing rebar modifier in the model database to match the current one.
Returns: True if successful, otherwise false.

Tekla.Structures.Model.BaseRebarModifier.Delete
Deletes the rebar modifier from the model database.
Returns: True if successful, otherwise false.

Tekla.Structures.Model.BaseRebarModifier.Select
Selects the rebar modifier from the model database. The identifier must be set.
Returns: True if successful, otherwise false.

Tekla.Structures.Model.BaseRebarModifier.SelectInstance
The select instance.
Returns:
The System.Boolean.

Tekla.Structures.Model.BaseRebarModifier.ModifyInstance
The modify instance.
Returns:
The System.Boolean.

Tekla.Structures.Model.BaseRebarModifier.CreateInstance
The create instance.
Returns:
The System.Boolean.

Tekla.Structures.Model.BaseRebarModifier.ToStruct(Tekla.Structures.ModelInternal.dotRebarStrip_t@)
The to struct.
dotStrip: The dot strip.

Tekla.Structures.Model.BaseRebarModifier.FromStruct(Tekla.Structures.ModelInternal.dotRebarStrip_t@)
The from struct.
dotStrip: The dot strip.